# Brewfile — macOS packages
# Usage: brew bundle --file=Brewfile

# ── Taps ──────────────────────────────────────────────────────────
tap "nikitabobko/tap"
tap "felixkratz/formulae"

# ── CLI tools ─────────────────────────────────────────────────────
brew "arttime"
brew "atuin"
brew "bat"
brew "bottom"
brew "btop"
brew "difftastic"
brew "duti"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fx"
brew "fzf"
brew "git-delta"
brew "gitui"
brew "glab"
brew "go"
brew "hyperfine"
brew "imagemagick"
brew "just"
brew "borders"
brew "lazydocker"
brew "mas"
brew "mise"
brew "oxlint"
brew "ast-grep"
brew "mprocs"
brew "bitwarden-cli"
brew "cargo-update"
# neovim is managed by bob (version manager) — pin 0.11.x to avoid 0.12 plugin breakage
brew "bob"
brew "ouch"
brew "poppler"
brew "posting"
brew "procs"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tlrc"
brew "tokei"
brew "unar"
brew "yazi"
brew "zellij"
brew "zoxide"

# ── Markdown ─────────────────────────────────────────────────────
brew "glow"

# ── Misc ─────────────────────────────────────────────────────────
brew "w3m"

# ── GUI apps ──────────────────────────────────────────────────────
cask "nikitabobko/tap/aerospace"
cask "choosy"
cask "claude"
cask "cursor"
cask "deepl"
cask "docker-desktop"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "iina"
# Menu bar: Ice hides clutter behind notch; @beta for macOS 26 Tahoe (conflicts with jordanbaird-ice stable)
cask "jordanbaird-ice@beta"
cask "languagetool"
cask "mouseless"
cask "nextcloud"
cask "obsidian"
cask "postman"
cask "raycast"
cask "stats"
cask "signal"
cask "slack"
cask "steermouse"
cask "thunderbird"
cask "todoist-app"
cask "wezterm@nightly"
cask "zed"

# ── Keyboard ─────────────────────────────────────────────────────
cask "qmk-toolbox"

# ── Mac App Store (requires `mas`) ───────────────────────────────
mas "Amphetamine", id: 937984704

# ── Fonts ─────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
