# Brewfile — macOS packages
# Usage: brew bundle --file=Brewfile

# ── Taps ──────────────────────────────────────────────────────────
tap "nikitabobko/tap"

# ── CLI tools ─────────────────────────────────────────────────────
brew "atuin"
brew "bat"
brew "bottom"
brew "btop"
brew "mise"
brew "zellij"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "git-delta"
brew "imagemagick"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "neovim"
brew "ouch"
brew "poppler"
brew "procs"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tlrc"
brew "tokei"
brew "unar"
brew "yazi"
brew "zoxide"

# ── Markdown ─────────────────────────────────────────────────────
brew "glow"

# ── Misc ─────────────────────────────────────────────────────────
brew "w3m"

# ── GUI apps ──────────────────────────────────────────────────────
cask "nikitabobko/tap/aerospace"
cask "choosy"
cask "claude"
cask "cursor"
cask "deepl"
cask "docker-desktop"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "iina"
cask "languagetool"
cask "maccy"
cask "mouseless"
cask "obsidian"
cask "postman"
cask "signal"
cask "slack"
cask "steermouse"
cask "thunderbird"
cask "todoist-app"
cask "wezterm"
cask "zed"

# ── Keyboard ─────────────────────────────────────────────────────
cask "qmk-toolbox"

# Albert (Homebrew cask `albertlauncher/albert/albert`): widgetsboxmodel needs QtStateMachine
brew "qtscxml"

# ── Mac App Store (requires `mas`) ───────────────────────────────
mas "Amphetamine", id: 937984704

# ── Fonts ─────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
