# Brewfile — macOS packages
# Usage: brew bundle --file=Brewfile

# ── Taps ──────────────────────────────────────────────────────────
tap "nikitabobko/tap"

# ── CLI tools ─────────────────────────────────────────────────────
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "imagemagick"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "neovim"
brew "poppler"
brew "ripgrep"
brew "starship"
brew "unar"
brew "yazi"
brew "zoxide"

# ── Terminal browser ─────────────────────────────────────────────
tap "browsh-org/browsh"
brew "browsh"

# ── GUI apps ──────────────────────────────────────────────────────
cask "nikitabobko/tap/aerospace"
cask "choosy"
cask "claude"
cask "copyq"
cask "cursor"
cask "deepl"
cask "docker"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "iina"
cask "languagetool"
cask "mouseless"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "steermouse"
cask "todoist-app"
cask "vlc"
cask "wezterm"

# ── Mac App Store (requires `mas`) ───────────────────────────────
mas "Amphetamine", id: 937984704

# ── Fonts ─────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
